{"type": "metadata", "language": "ru", "language_probability": 0.99658203125, "duration": 9629.292, "source_audio": "Большой марафон по Классическому AI. День 1._video_mp4.wav", "granularity": "paragraph"}
{"type": "paragraph", "id": 1, "text": "Давайте плюсы, вопросы, ответы. Видно, слышно, не видно, не слышно. Видно, слышно, толку. Разные могут быть варианты. Видно, слышно. Видно, слышно, все ок. И да, есть такие варианты. что, мы с вами начинаем. У нас вебов не было две недели. Прям я соскучился. Надеюсь, вы тоже. Когда вебов по четыре в неделю, я обычно такой на очередной вебе, что господи, очередной веб. Когда я буду жить? А вот когда раз две недели не было, прям интересненько. Но следующие две недели мы с вами плотненько. У нас будет четыре вебинара. Прям четыре. Цветок все тот же. Скоро он на елку должен замениться. Надо же, праздник там приходит. Скоро здесь должна.. Либо мы его украсим.", "segments": [{"start": 135.63, "end": 166.6, "text": "Давайте плюсы, вопросы, ответы. Видно, слышно, не видно, не слышно. Видно, слышно, толку. Разные могут быть варианты. Видно, слышно. Видно, слышно, все ок. И да, есть такие варианты."}, {"start": 166.6, "end": 188.96, "text": "что, мы с вами начинаем. У нас вебов не было две недели. Прям я соскучился. Надеюсь, вы тоже. Когда вебов по четыре в неделю, я обычно такой на очередной вебе, что господи, очередной веб. Когда я буду жить?"}, {"start": 188.96, "end": 200.25, "text": "А вот когда раз две недели не было, прям интересненько. Но следующие две недели мы с вами плотненько. У нас будет четыре вебинара."}, {"start": 200.69, "end": 214.67, "text": "Прям четыре. Цветок все тот же. Скоро он на елку должен замениться. Надо же, праздник там приходит. Скоро здесь должна.. Либо мы его украсим."}], "start": 135.63, "end": 214.67}
{"type": "paragraph", "id": 2, "text": "у нас теперь с вами четыре вебинара, целый марафон. Я думаю, вы уже знаете, какие темы. Сегодня как кодить на Python с помощью GPT и будут прям прикольные штуки. Не только как с помощью GPT кодить, а вообще прикольные штуки покажу.", "segments": [{"start": 216.58, "end": 231.01, "text": "у нас теперь с вами четыре вебинара, целый марафон. Я думаю, вы уже знаете, какие темы. Сегодня как кодить на Python с помощью GPT и будут прям прикольные штуки. Не только как с помощью GPT кодить, а вообще прикольные штуки покажу."}], "start": 216.58, "end": 231.01}
{"type": "paragraph", "id": 3, "text": "Четверг будет классический. Классический NLP. Я думаю, вам это будет очень интересно, потому что мы его тысячу лет не рассказывали, потому что все пришли на NLM, а там, оказывается, есть.. Можно свои трансформеры обучать. Короче, там прикольные штуки можно делать. Там можно делать всякие name and condition, используя простые легкие классические модельки. И некоторые результаты там даже интереснее, чем у GPT.", "segments": [{"start": 233.2, "end": 235.02, "text": "Четверг будет классический."}, {"start": 235.04, "end": 258.5, "text": "Классический NLP. Я думаю, вам это будет очень интересно, потому что мы его тысячу лет не рассказывали, потому что все пришли на NLM, а там, оказывается, есть.. Можно свои трансформеры обучать. Короче, там прикольные штуки можно делать. Там можно делать всякие name and condition, используя простые легкие классические модельки. И некоторые результаты там даже интереснее, чем у GPT."}], "start": 233.2, "end": 258.5}
{"type": "paragraph", "id": 4, "text": "классический NLP очень интересный. Всякие вот BERT и T5.", "segments": [{"start": 259.41, "end": 263.85, "text": "классический NLP очень интересный. Всякие вот BERT и T5."}], "start": 259.41, "end": 263.85}
{"type": "paragraph", "id": 5, "text": "А GPT 2, типа те каменный век, стародавние времена, которые.. Ну, а для меня они свежи в воспоминаниях, потому что мы же преподавали и в 2019, и в 2020, и в 2021, и GPT еще тогда не было. 3.5, чат GPT. Типа инстракт обучения NLM-ок не было. Вот. Короче, очень интересная тема, и которую мы не обозревали тысячу лет. Дальше. В следующий вторник будет.. Вы проголосовали, мы сделали. Это такая самая фундаментальная библиотека по созданию нейронок. Она сложнее, чем Keras. Более глубокая, чем Keras. Уж тем более, чем всякие AutoML и AutoKeras. Там у нас вообще управление полностью созданием графа нейронки, слоями, градиентами и всем таким. Короче, продвинутые управления созданием нейронки. Всякие чат GPT или глубокие нейронки компьютерного зрения и так далее, все на Python, все написано.", "segments": [{"start": 265.59, "end": 284.64, "text": "А GPT 2, типа те каменный век, стародавние времена, которые.. Ну, а для меня они свежи в воспоминаниях, потому что мы же преподавали и в 2019, и в 2020, и в 2021, и GPT еще тогда не было. 3.5, чат GPT. Типа инстракт обучения NLM-ок не было."}, {"start": 284.64, "end": 294.98, "text": "Вот. Короче, очень интересная тема, и которую мы не обозревали тысячу лет. Дальше."}, {"start": 294.98, "end": 296.98, "text": "В следующий вторник будет.."}, {"start": 297.54, "end": 309.86, "text": "Вы проголосовали, мы сделали. Это такая самая фундаментальная библиотека по созданию нейронок. Она сложнее, чем Keras. Более глубокая, чем Keras. Уж тем более, чем всякие AutoML и AutoKeras."}, {"start": 310.4, "end": 327.23, "text": "Там у нас вообще управление полностью созданием графа нейронки, слоями, градиентами и всем таким. Короче, продвинутые управления созданием нейронки. Всякие чат GPT или глубокие нейронки компьютерного зрения и так далее, все на Python, все написано."}], "start": 265.59, "end": 327.23}
{"type": "paragraph", "id": 6, "text": "И на собеседованиях PyTorch просят. И в нашем курсе IML-разработчик. Если раньше мы принципиально говорили Keras, Keras, только Keras, наша любовь, то теперь у нас PyTorch и TensorFlow есть в курсе IML-разработчик. Так что в следующий вторник будет PyTorch. И завершаем следующий четверг. Обучение с подкреплением. Тоже вам нравится эта тема всегда. У нас не так давно был вебинар. Мы частично сохраним оттуда все самое интересное типа трейдинга, а частично сделаем новое. это когда нейронка обучается в реальном среде. В реальном времени. Типа для трейдинга, для автопилотов машин, для прямохождения роботов, для ботов в компьютерных играх и так далее. Да много где можно обучение с подкреплением применять.", "segments": [{"start": 329.27, "end": 342.61, "text": "И на собеседованиях PyTorch просят. И в нашем курсе IML-разработчик. Если раньше мы принципиально говорили Keras, Keras, только Keras, наша любовь, то теперь у нас PyTorch и TensorFlow есть в курсе IML-разработчик. Так что в следующий вторник будет PyTorch."}, {"start": 342.61, "end": 354.53, "text": "И завершаем следующий четверг. Обучение с подкреплением. Тоже вам нравится эта тема всегда. У нас не так давно был вебинар. Мы частично сохраним оттуда все самое интересное типа трейдинга, а частично сделаем новое."}, {"start": 355.37, "end": 359.03, "text": "это когда нейронка обучается в реальном среде."}, {"start": 359.27, "end": 368.39, "text": "В реальном времени. Типа для трейдинга, для автопилотов машин, для прямохождения роботов, для ботов в компьютерных играх и так далее. Да много где можно обучение с подкреплением применять."}], "start": 329.27, "end": 368.39}
{"type": "paragraph", "id": 7, "text": "Вот. Короче, вот такие четыре века планируются. Плюс у нас для вас новая акция прикольная. Рулетку мы решили сделать. Только что прошла черная пятница, но у нас следующая для вас кайфовая акция. Вот. Коротко я расскажу сейчас в начале, а подробно в конце.", "segments": [{"start": 370.33, "end": 381.21, "text": "Вот. Короче, вот такие четыре века планируются. Плюс у нас для вас новая акция прикольная. Рулетку мы решили сделать. Только что прошла черная пятница, но у нас следующая для вас кайфовая акция."}, {"start": 381.53, "end": 384.89, "text": "Вот. Коротко я расскажу сейчас в начале, а подробно в конце."}], "start": 370.33, "end": 384.89}
{"type": "paragraph", "id": 8, "text": "И еще мы сделали для вас рулетку. Сделали для вас рулетку в ТГ-боте. Я вам покажу. Она прикольная, удобная, более удобная, чем раньше была в коллабе. Короче, прикольную ТГ-ботную рулетку для вас собрали.", "segments": [{"start": 387.74, "end": 391.7, "text": "И еще мы сделали для вас рулетку."}, {"start": 392.08, "end": 416.18, "text": "Сделали для вас рулетку в ТГ-боте. Я вам покажу. Она прикольная, удобная, более удобная, чем раньше была в коллабе. Короче, прикольную ТГ-ботную рулетку для вас собрали."}], "start": 387.74, "end": 416.18}
{"type": "paragraph", "id": 9, "text": "Вот. Короче, такая история у нас. Сегодня традиционные две новости. Коротко расскажу про рулетку и потом контент-контент. Контент-то сегодня тьма тьмущая, поэтому два с половиной часа целимся. Демонстрация экрана. Новости.", "segments": [{"start": 417.3, "end": 434.0, "text": "Вот. Короче, такая история у нас. Сегодня традиционные две новости. Коротко расскажу про рулетку и потом контент-контент. Контент-то сегодня тьма тьмущая, поэтому два с половиной часа целимся. Демонстрация экрана."}, {"start": 434.92, "end": 435.4, "text": "Новости."}], "start": 417.3, "end": 435.4}

